import React from 'react';
import '../styles/about.css';

const About = () => {
  return (
    <div className="about">
      <div className="article">
        <h1>Судоку</h1>
        <div className="preambula">
          <strong>Судоку</strong> - головоломка с числами.
          Иногда судоку называют магическим квадратом, что в
          общем-то неверно, так как судоку является латинским
          квадратом 9-го порядка. Судоку активно публикуют
          газеты и журналы разных стран мира, сборники судоку
          издаются большими тиражами. Решение судоку — популярный
          вид досуга.
        </div>
        <div className="rules">
          <h3>Правила</h3>
          <p>
            Игровое поле представляет собой квадрат размером 9×9,
            разделённый на меньшие квадраты со стороной в 3 клетки.
            Таким образом, всё игровое поле состоит из 81 клетки.
            В них уже в начале игры стоят некоторые числа (от 1 до 9),
            называемые подсказками. От игрока требуется заполнить
            свободные клетки цифрами от 1 до 9 так, чтобы в каждой
            строке, в каждом столбце и в каждом малом квадрате 3×3
            каждая цифра встречалась бы только один раз.
          </p>
          <p>
            Сложность судоку зависит от количества изначально заполненных
            клеток и от методов, которые нужно применять для её решения.
            Самые простые решаются дедуктивно: всегда есть хотя бы одна
            клетка, куда подходит только одно число. Некоторые головоломки
            можно решить за несколько минут, на другие можно потратить часы.
          </p>
          <p>
            Правильно составленная головоломка имеет только одно решение.
            Тем не менее, на некоторых сайтах в интернете под видом
            усложнённых головоломок пользователю предлагаются варианты
            судоку с несколькими вариантами решения, а также с ветвлениями
            самого хода решения.
          </p>
        </div>
      </div>
    </div>
  );
}

export default About;

